{
    "roles": [
      {
        "name": "ShahrSaD",
        "description": "The \"Shahr Sade\" is a simple citizen without any special powers or abilities. Their primary goal is to help the town identify and eliminate the mafia members through voting during the day. They rely on their deduction skills and the information shared by other roles.",
        "faction": "Villager"
      },
      {
        "name": "Doctor",
        "description": "The Doctor has the ability to save one person each night from being killed. They can choose to heal themselves or another player, effectively protecting them from an assassination attempt. The Doctor's role is crucial in maintaining balance and keeping the town's key players alive.",
        "faction": "Villager"
      },
      {
          "name": "Kar Agah",
          "description": "The \"Kar Agah,\" or Detective, can investigate one person each night to determine if they are a member of the mafia or not. If they choose the God Father, their investigation will be incorrect. This role is vital for gathering information and guiding the town's decisions during the day.",
          "faction": "Villager"
      },
      {
          "name": "Tof Dar",
          "description": "The \"Tofang Dar,\" or Gunman, can distribute real and fake guns to the players, which they can use during the game.",
          "faction": "Villager"
      },
      {
          "name": "Tak Tir",
          "description": "The \"Tak Tir Andaz,\" or Sniper, has the ability to kill one player during the night. They die if they choose a citizen.",
          "faction": "Villager"
      },
      {
          "name": "Cowboy",
          "description": "The Cowboy can choose a player to remove from the game. However, they will also leave the game after that action.",
          "faction": "Villager"
      },
      {
          "name": "Ruyin tan",
          "description": "The \"Ruyin Tan,\" or Bulletproof, is immune to being killed at night once. If targeted, they will survive the first assassination attempt but can still be eliminated by other means, such as voting during the day.",
          "faction": "Villager"
      },
      {
          "name": "Jasoos",
          "description": "The \"Jasoos,\" or Spy, will know who all the Mafia members are on the first night.",
          "faction": "Villager"
      },
      {
          "name": "Keshish",
          "description": "The \"Keshish,\" or Priest, has the power to unsilence one player during the night. If voted out during the day, they can reveal the role of a player to the public.",
          "faction": "Villager"
      },
      {
          "name": "Nanva",
          "description": "The \"Nanva,\" or Baker, is crucial for the town's survival. If they die, the town will starve to death after 5 days (or as announced by the coordinator).",
          "faction": "Villager"
      },
      {
          "name": "Bisim chi",
          "description": "The \"Bisim Chi,\" or Radio Operator, can distribute a Bisim or Walkie-Talkie to two people. If both are citizens, the coordinator will wake them up so they can know each other.",
          "faction": "Villager"
      },
      {
          "name": "Hacker",
          "description": "The Hacker will choose two people on the first night. If one of them is Mafia, the coordinator will publicly announce that the chosen list is dangerous. If two citizens or two Mafia are chosen, the announcement will not be dangerous.",
          "faction": "Villager"
      },
      {
          "name": "Efsha Gar",
          "description": "The \"Efsha Gar,\" or Revealer, can choose 1 player on two separate nights (2 overall). The chosen players' roles will be revealed if they leave the game.",
          "faction": "Villager"
      },
      {
          "name": "Afyun",
          "description": "The \"Afyun,\" or Opium Dealer, can neutralize the Mafia's abilities for one night. However, they will leave the game after taking this action.",
          "faction": "Villager"
      },
      {
          "name": "Gor Kan",
          "description": "The \"Gor Kan,\" or Gravedigger, can request an announcement from the coordinator. The next day, the coordinator will announce the roles of the players who have left the game.",
          "faction": "Villager"
      },
      {
          "name": "Ghazi",
          "description": "The \"Ghazi,\" or Judge, can wake up once during the game and change the outcome of the election.",
          "faction": "Villager"
      },
      {
          "name": "Majhool",
          "description": "Two citizens who wake up to know each other and form a group. They should wake up each night and add a citizen to their group. If they choose a Mafia member, they all die.",
          "faction": "Villager"
      },
      {
          "name": "MafiaSa",
          "description": "The \"Mafia Sade\" is a regular mafia member without any special abilities. Their goal is to blend in with the town, avoid detection, and eliminate town members during the night.",
          "faction": "Mafia"
      },
      {
          "name": "God F",
          "description": "The God Father is the leader of the mafia. They appear innocent if investigated by the Detective and make the final decision on who the mafia targets each night. Their survival is crucial for the mafia's success.",
          "faction": "Mafia"
      },
      {
          "name": "Mashoghe",
          "description": "The \"Mashoghe,\" or Lover of the God Father, makes the God Father furious if they die, allowing the Mafia to kill two people the following night.",
          "faction": "Mafia"
      },
      {
          "name": "Joker",
          "description": "The Joker chooses a player during the night. If the Kar Agah or Detective chooses the same player, the Joker's action will reverse the results, revealing Mafia members as town and citizens as Mafia.",
          "faction": "Mafia"
      },
      {
          "name": "DoctorLec",
          "description": "Doctor Lecter can save one of the Mafia members from the \"Tak Tir Andaz\" or Sniper each night.",
          "faction": "Mafia"
      },
      {
          "name": "Natasha",
          "description": "Natasha can silence one player each night, preventing them from talking during the next day. The Keshish or Priest can neutralize the silence effect if they choose the same person.",
          "faction": "Mafia"
      },
      {
          "name": "Terrorist",
          "description": "If the Terrorist dies during the day by a gun or vote, they can take someone with them out of the game.",
          "faction": "Mafia"
      },
      {
          "name": "Mozakere",
          "description": "The \"Mozakere Konande,\" or Negotiator, can negotiate with some town citizens to become Mafia Sade. The negotiation can only be performed on Shahr Sade (simple citizens) or other roles announced by the coordinator.",
          "faction": "Mafia"
      },
      {
          "name": "ShahKosh",
          "description": "The \"Shah Kosh,\" or King Slayer, can guess the role of a citizen during the night. If guessed correctly, that player will be removed from the game.",
          "faction": "Mafia"
      },
      {
          "name": "Zodiac",
          "description": "An independent serial killer immune to night attacks, killing on even nights, but vulnerable to day actions and bombs.",
          "faction": "Independent"
      },
      {
          "name": "AlCapone",
          "description": "The head of the mafia team who decides the night's kill. Their investigation result for the detective is negative. If a Professional hits them, the Professional is eliminated.",
          "faction": "Mafia"
      },
      {
          "name": "MaskedFigure",
          "description": "Their investigation result for the detective is positive. Neither they know their allies, nor their allies know them. They cannot be eliminated by the mafia shot at night. Alpha Power: Once per game, they can freeze the detective's investigation. The detective will receive a neutral result and can no longer investigate that person. Beta Power: Once per game, they can guess a citizen's role. If correct, the game master confirms; if wrong, they deny it. The guessed player is immediately aware of being transformed into a basic citizen and can be turned into a Yakuza from that night on. Note 1: If the Mafia Boss and Yakuza are eliminated, it is publicly announced that the Masked Figure takes off their mask and the Mafia's night kill is assigned to them. Note 2: In Note 1's scenario, if a player has been turned into a Yakuza, the Masked Figure and the Yakuza are introduced and wake up together from that night on. Note 3: If the Masked Figure has not used their powers, they can still use them when they wake up with their allies.",
          "faction": "Mafia"
      },
      {
          "name": "DoubleFace",
          "description": "A member of the mafia team but never wakes up with them and always appears as a citizen for the detective.",
          "faction": "Mafia"
      },
      {
          "name": "Yakuza",
          "description": "A member of the mafia. When they feel their role is revealed, they can turn one player into a mafia member, sacrificing themself. If the doctor saves the Yakuza by mistake, they remain in the game.",
          "faction": "Mafia"
      },
      {
          "name": "MafiaSpecialist",
          "description": "If the number of players alive is half or less, they can take on a mafia role that was eliminated previously.",
          "faction": "Mafia"
      },
      {
          "name": "Butcher",
          "description": "Can convert all eliminated mafia members to regular citizens once in the game.",
          "faction": "Mafia"
      },
      {
          "name": "Thief",
          "description": "Similar to Natasha, is part of the black roles. They are not introduced to the mafia and they are not introduced to them. Can steal someone's role and use it.",
          "faction": "Mafia"
      },
      {
          "name": "Trickster",
          "description": "Part of the mafia team. Each night, they point to two players. If one is a doctor and one is a detective, the doctor is killed and the detective is saved.",
          "faction": "Mafia"
      },
      {
          "name": "Enchanter",
          "description": "Part of the mafia. Each night, they can block one person's ability or place a word curse (4 or more letters). If the player uses that word the next day, they are eliminated.",
          "faction": "Mafia"
      },
      {
          "name": "Saboteur",
          "description": "A mafia member who can sabotage players using a gun. If a gun owner shoots after being sabotaged, they are killed.",
          "faction": "Mafia"
      },
      {
          "name": "PoisonMaker",
          "description": "Can be in either the Mafia or Citizen team. They can poison one player once per game. The poisoned player is eliminated two days later. Mafias cannot shoot on the night they use poison.",
          "faction": "Mafia"
      },
      {
          "name": "Spy",
          "description": "A mafia member. If a Freemason wakes them, they become part of the Freemason team.",
          "faction": "Mafia"
      },
      {
          "name": "StrongMan",
          "description": "Can use his kill one time in the game with the godfather's confirmation. The targeted person will surely die even if they are a tough player.",
          "faction": "Mafia"
      },
      {
          "name": "Buyer",
          "description": "In the first night, the Buyer discusses with the mafia on who to buy. Then, they wake one person, if that player is a doctor, he doesn't wake up. Otherwise, that person can decide to join the mafia team or not.",
          "faction": "Mafia"
      },
      {
          "name": "NamelessMafia",
          "description": "Once per game can take on any mafia or citizen role for 24 hours.",
          "faction": "Mafia"
      },
      {
          "name": "Dynamite",
          "description": "A mafia member that can attach a bomb to a player. The next morning, the narrator says a bomb is attached to them. That player chooses to either sacrifice themselves or cuts a wire, if they chose the wrong one they are eliminated.",
          "faction": "Mafia"
      },
      {
          "name": "LadyVoodoo",
          "description": "A mafia role. Each night they choose a player and a word (more than two letters). The narrator says the word. If the chosen player uses the word during the day, they are immediately removed from the game.",
          "faction": "Mafia"
      },
      {
          "name": "AdamSnowman",
          "description": "A citizen with one bullet. If they shoot a citizen or the mafia boss, it doesn't work, and they get the bullet back in the next night.",
          "faction": "Villager"
      },
      {
          "name": "Gambler",
          "description": "A citizen who can double the ability of one citizen or one mafia member twice.",
          "faction": "Villager"
      },
      {
          "name": "Link",
          "description": "At the start of the game links two players together. If one dies, the other dies as well.",
          "faction": "Villager"
      },
      {
          "name": "Hunter",
          "description": "Each night can link himself to one player. If they are killed by a night shot or in the next day's voting, the other player dies with them. This effect is lost if the chosen player is killed before the hunter.",
          "faction": "Villager"
      },
      {
          "name": "PoliceChief",
          "description": "If they die during the day, the game master says this person is the police chief and they get one shot. If it is used on a mafia, they are eliminated; otherwise, nothing happens.",
          "faction": "Villager"
      },
      {
          "name": "Revealer",
          "description": "If eliminated during the game, their role and the reason of death are revealed to everyone.",
          "faction": "Villager"
      },
      {
          "name": "CitizenSpecialist",
          "description": "If the number of players alive is half or less, they can take on a citizen role that was eliminated previously.",
          "faction": "Villager"
      },
      {
          "name": "Judge",
          "description": "Once per game can overturn the results of the day's voting.",
          "faction": "Villager"
      },
      {
          "name": "Commander",
          "description": "Wakes up after the sniper takes their shot. Can confirm or deny the sniper's shot. If they deny, it won't hit. If the sniper mistakenly kills a citizen, the commander may be removed as well (depending on the scenario)",
          "faction": "Villager"
      },
      {
          "name": "Elite",
          "description": "Once in the game can ask the game master a citizen role. For example, they might ask who the doctor is.",
          "faction": "Villager"
      },
      {
          "name": "Gunsmith",
          "description": "Can give a special gun with one powerful bullet to one player. That player can use it the next day and is publicly announced. If they do not shoot they must give it to another person the next night. However, the gun can also be sabotaged, and if shot, the shooter dies.",
          "faction": "Villager"
      },
      {
          "name": "Priest",
          "description": "Each night, they can select a number of players. The next day, those players can speak longer and are immune to the silencer.",
          "faction": "Villager"
      },
      {
          "name": "Doppelganger",
          "description": "Starts with no allegiance, each night they choose a player. When the chosen player is eliminated, the Doppelganger gains their ability.",
          "faction": "Villager"
      },
      {
          "name": "Tyler",
          "description": "Wakes up on the first night with a Mason. They know each other and form a Freemason team.",
          "faction": "Villager"
      },
      {
          "name": "Freemason",
          "description": "Wakes up each night and shows a player. If that player is a citizen they wake and join the team. They only know each other and can discuss but cannot talk about their roles. If a mafia is chosen by mistake, all the masons are eliminated.",
          "faction": "Villager"
      },
      {
          "name": "Inquisitor",
          "description": "Similar to the detective. Can choose two players and ask the game master if they are on the same team. The game master only says they are on the same side and not if they are citizens or mafia.",
          "faction": "Villager"
      },
      {
          "name": "Blacksmith",
          "description": "Each night can provide a suit of armor. The person with the armor will not be removed during the day and the armor falls off.",
          "faction": "Villager"
      },
      {
          "name": "CodeWriter",
          "description": "Can write a binary or 3-variable code for the game master. If there are two mafias sitting next to each other in the binary option, the game master will say yes, or if 3 players sit beside each other in the three variable option.",
          "faction": "Villager"
      },
      {
          "name": "RussianRoulette",
          "description": "Each night the player gives a gun to someone and picks a number. The person who has the gun in the day can shoot someone, and the person who is shot shoots again till they reach the decided number. This action can only happen once if the shot is taken in the day.",
          "faction": "Villager"
      },
      {
          "name": "Spider",
          "description": "Can weave together a number of players. If any of the woven players die during the day, all woven players die as well.",
          "faction": "Villager"
      },
      {
          "name": "Sniper",
          "description": "Can shoot and kill one player. The conditions are stated by the game master.",
          "faction": "Villager"
      },
      {
          "name": "Bartender",
          "description": "Each night chooses a player who becomes \"drunk\" and cannot use their ability.",
          "faction": "Villager"
      },
      {
          "name": "Saba",
          "description": "Each night can pick a player and take their role for 24 hours and must use that role.",
          "faction": "Villager"
      },
      {
          "name": "Wizard",
          "description": "Once in the game, they can choose a player. That player loses their ability and does not wake up at night for 24 hours.",
          "faction": "Villager"
      },
      {
          "name": "Guardian",
          "description": "If a zodiac tries to kill the Guardian, they are eliminated instead. If the bomb is on them, they get the code for defusal. If the bomb is on another player, they can defuse it.",
          "faction": "Villager"
      },
      {
          "name": "Bomber",
          "description": "If killed at night, two players on their sides also die. They can use their power once and take two players out with them.",
          "faction": "Villager"
      },
      {
          "name": "Exposer",
          "description": "If they are eliminated by the day's vote and not by night kill, they can choose one player and reveal to all whether they are a citizen or a mafia member.",
          "faction": "Villager"
      },
      {
          "name": "Physician",
          "description": "Each night, they give an antidote to a player. If that player was poisoned, they survive. They can save themself twice with their antidote.",
          "faction": "Villager"
      },
      {
          "name": "ToughGuy",
          "description": "If they are shot by the mafia, they are not eliminated, but they lose their ability for that night and are eliminated on the second mafia shot.",
          "faction": "Villager"
      },
      {
          "name": "Sacrifice",
          "description": "At any time can sacrifice themself to protect another person who will be voted out from the game.",
          "faction": "Villager"
      },
      {
          "name": "Sheriff",
          "description": "Each night, they can shoot one player. If they shoot a mafia member, they are eliminated. If they shoot a citizen, they are eliminated.",
          "faction": "Villager"
      },
      {
          "name": "NightWatch",
          "description": "One night in the game they can ask the game master who targeted them. The game master only reveals the players but not their roles.",
          "faction": "Villager"
      },
      {
          "name": "Swordsman",
          "description": "A citizen who can give a sword to another person one time in the game. That person is told that they have a sword at night and can use it. This will not work against the sultan. A doctor can save the killed person.",
          "faction": "Villager"
      },
      {
          "name": "Jupiter",
          "description": "Protects a citizen from becoming a yakuza each night.",
          "faction": "Villager"
      },
      {
          "name": "Ronan",
          "description": "If attacked at night and not saved by the doctor, it's announced the next morning. Ronan can vote and participate till the voting is complete for that day.",
          "faction": "Villager"
      },
      {
          "name": "Avenger",
          "description": "If they guess the night's killer correctly, the game master gives them a gun. If in a 10, 9, or 8 player game, he gets 2 guesses and one guess after 7 players. They can use this gun at any point before the voting and must choose one person. The killed person's side is revealed.",
          "faction": "Villager"
      },
      {
          "name": "MunitionsExpert",
          "description": "Gives a weapon to a player once in the game. The player can use it the following day. They say \"Long live the homeland\" and the master confirms it. Then they announce two people who are most suspicious. After their speeches, the player can shoot one. After that the side of the killed person is revealed.",
          "faction": "Villager"
      },
      {
          "name": "Investigator",
          "description": "Can find out the faction of a player, but should be aware of the Sultan and the Mercenary.",
          "faction": "Villager"
      },
      {
          "name": "Executioner",
          "description": "If a player is executed by voting, it will be unknown by all the players. If the executioner dies his identity will be revealed.",
          "faction": "Villager"
      },
      {
          "name": "Scribe",
          "description": "Gives a paper and pen to a player. If that player is killed that night, they can make a will. If the Scribe reveals their role, the sultan has two poisons that night.",
          "faction": "Villager"
      },
      {
          "name": "WiseMan",
          "description": "Can once in the game in the middle of the day save one player from being in the second round of voting.",
          "faction": "Villager"
      },
      {
          "name": "NightWanderer",
          "description": "Can leave their tent for one night in the game and no one can reach them. If poisoned or given a weapon, it has no effect.",
          "faction": "Villager"
      },
      {
          "name": "Ocean",
          "description": "Can wake two citizens in the game and they get to know each other but cannot talk about their roles. If they pick a mafia or zodiac they are eliminated the next day.",
          "faction": "Villager"
      },
      {
          "name": "Jigsaw",
          "description": "They are immortal at night, and every night will chose 3 players and give a saw to one of them. In the day, they call them to the gas room. The game will stop and the game master will say who has the saw. That player will decide who to kill. Every player can only be called to the gas chamber once.",
          "faction": "Independent"
      },
      {
          "name": "JackSparrow",
          "description": "Neither mafia nor citizen, they need to win alone. They are immune to night kills, day voting and their role is only shown. They need to curse one person every night. They are eliminated if their cursed one dies, if someone guesses their role with the \"Beautiful Mind\" card, or if the godfather uses their \"sixth sense\". If all mafia members die, the city does not win and Jack wins, or if they are one of the last three players. If there are 2 citizens, jack, and 3 mafias in the game, then mafias can only win if they kill Jack's cursed one.",
          "faction": "Independent"
      },
      {
          "name": "SherlockHolmes",
          "description": "This independent role helps the third godfather role. For the first two nights, they are immortal, and can move the game in the direction of the citizen, mafia, or independent sides. Each night before mafias they wake up and guess the role of one player using their sixth sense. If correct, the roles of Sherlock and the chosen player swap and the chosen player is butchered. If Sherlock doesn't guess a player, he can reach the \"Ace\" state and win alone.",
          "faction": "Independent"
      },
      {
          "name": "Carrier",
          "description": "Every player that chooses the carrier in the night will become infected. The infected player can't speak on the first day and can't perform any actions in the night. The second day they can't vote, and they die in the second night.",
          "faction": "Independent"
      },
      {
          "name": "Werewolf",
          "description": "Turns a player into a wolf every three nights. Their attack is useless against the hunter and priest. Only the hunter can kill a wolf at night. Their win condition is to obtain half of the players as wolves.",
          "faction": "Independent"
      },
      {
          "name": "Syndicate",
          "description": "Knows the mafia, spy, doctor, detective, and the thug. Immune to mafia and thug group attacks. If voted in the second round, they kill one person from the black list. Their win condition is to be one of the last three players.",
          "faction": "Independent"
      },
      {
          "name": "Killer",
          "description": "One of the strongest independent roles. Each night the game master wakes them and they kill one person. The doctor can't save the player. Their goal is to stay alive till the end of the game and eliminate all other players. The citizen and mafia players should not be of the same amount.",
          "faction": "Independent"
      },
      {
          "name": "Corona",
          "description": "An independent role. Can infect any player, mafia or citizen. Can only be removed in the day. Any player who interacts with the Corona in the night will die the next day if the doctor does not save them.",
          "faction": "Independent"
      },
      {
          "name": "Unknown",
          "description": "Has no team in the beginning. Gets chosen at night, and joins the choosers team. If the independents win they also win. If they aren't chosen till the end of the game, they lose.",
          "faction": "Independent"
      },
      {
          "name": "ThousandFace",
          "description": "Can take on the ability of any player that leaves in the day for one day. Also, if any player targets the Thousand Face, that target goes back to them in the night. As an independent, they need to survive to the last three players.",
          "faction": "Independent"
      }
    ]
  }